# 实习二：数据库约束设计
___

## 组员：陈萧白，凤大骅，万承志

本次实习需要完成部门和职员表的约束设计，以及滑动窗口模拟的触发器设计。我们先连接数据库，然后依次完成练习。

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%sql mysql://stu2000012926:stu2000012926@162.105.146.37:43306
%sql use stu2000012926;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.

[]

In [2]:
%%sql
show tables;

 * mysql://stu2000012926:***@162.105.146.37:43306
17 rows affected.

[('Dynamic_state_tb',),
 ('aggResult',),
 ('broadcasting_room_tb',),
 ('bullet_comment_tb',),
 ('comment_tb',),
 ('department',),
 ('employees',),
 ('follow_tb',),
 ('gift_tb',),
 ('gifts_record_tb',),
 ('like_Dstate_tb',),
 ('max_slidingWin',),
 ('msg_tb',),
 ('originData',),
 ('sum_slidingWin',),
 ('user_tb',),
 ('users_in_broom_tb',)]

## 练习一：约束设计
---
根据练习要求，我们建立职员表与部门表如下：

In [3]:
%%sql
# 职员表
set foreign_key_checks=0;

drop table if exists employees;

CREATE TABLE employees (
    eno INT UNSIGNED PRIMARY KEY,
    ename VARCHAR(10) NOT NULL,
    dno INT UNSIGNED NOT NULL,
    salary INT UNSIGNED NOT NULL,
    level INT UNSIGNED NOT NULL,
    email VARCHAR(32),
    CHECK(email REGEXP'^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(.[a-zA-Z0-9_-]+)+$') # 条件4
);

set foreign_key_checks=1;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [4]:
%%sql
# 部门表
set foreign_key_checks=0;

drop table if exists department;

CREATE TABLE department (
    dno INT UNSIGNED PRIMARY KEY,
    dname enum('销售部','财务部','人事部'), # 条件2
    manager INT UNSIGNED NOT NULL,
    budget INT UNSIGNED NOT NULL
);

set foreign_key_checks=1;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
# 设置约束
set foreign_key_checks=0;

# 条件1
ALTER TABLE employees ADD CONSTRAINT fk_dno FOREIGN KEY(dno) REFERENCES department(dno);
ALTER TABLE department ADD CONSTRAINT fk_manager FOREIGN KEY(manager) REFERENCES employees(eno);

# 条件3
ALTER TABLE employees ADD CONSTRAINT chk_salary CHECK(
    (1<=level) and (level<=5) and (1000*level <= salary) and (salary< 1000*level+1000)
);

# 条件5 用触发器实现
# 职员表插入时进行检查
CREATE TRIGGER tri_employees_insert BEFORE INSERT ON employees FOR EACH ROW
BEGIN
    DECLARE remain_budget INT UNSIGNED;
    SET remain_budget = (SELECT budget FROM department WHERE department.dno = new.dno)
                        - (SELECT SUM(salary) FROM employees WHERE employees.dno = new.dno);
    IF new.salary>remain_budget THEN
        SET new.salary = remain_budget;
    END IF;
END;
# 职员表修改时进行检查
CREATE TRIGGER tri_employees_update BEFORE UPDATE ON employees FOR EACH ROW
BEGIN
    DECLARE remain_budget INT UNSIGNED;
    SET remain_budget = (SELECT budget FROM department WHERE department.dno = new.dno)
                        - (SELECT SUM(salary) FROM employees WHERE employees.dno = new.dno);
    IF new.salary>old.salary+remain_budget THEN
        SET new.salary = old.salary + remain_budget;
    END IF;
END;
# 部门表修改时进行检查
CREATE TRIGGER tri_department_update BEFORE UPDATE ON department FOR EACH ROW
BEGIN
    DECLARE sum_salary INT UNSIGNED;
    SET sum_salary = (SELECT SUM(salary) FROM employees WHERE employees.dno = new.dno);
    IF new.budget<sum_salary THEN
        SET new.budget = sum_salary;
    END IF;
END;

set foreign_key_checks=1;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

创建完成后，向表中正常插入数据并查看如下：

In [6]:
%%sql
set foreign_key_checks=0;

INSERT INTO department VALUES (1,'销售部',2,7000);

INSERT INTO employees VALUES (1,'1号员工',1,1300,1,'111@qq.com');
INSERT INTO employees VALUES (2,'2号员工',1,2600,2,'222@qq.com');

set foreign_key_checks=1;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.

[]

In [7]:
%%sql
SELECT * FROM employees

 * mysql://stu2000012926:***@162.105.146.37:43306
2 rows affected.

[(1, '1号员工', 1, 1300, 1, '111@qq.com'), (2, '2号员工', 1, 2600, 2, '222@qq.com')]

In [8]:
%%sql
SELECT * FROM department

 * mysql://stu2000012926:***@162.105.146.37:43306
1 rows affected.

[(1, '销售部', 2, 7000)]

接下来逐一验证约束的正确性，如下：

In [9]:
%%sql
# 检查条件1
# 插入dno不存在的员工
INSERT INTO employees VALUES(3,'3号员工',2,2000,2,'333@qq.com');

 * mysql://stu2000012926:***@162.105.146.37:43306
(pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`stu2000012926`.`employees`, CONSTRAINT `fk_dno` FOREIGN KEY (`dno`) REFERENCES `department` (`dno`))')
[SQL: # 检查条件1
# 插入dno不存在的员工
INSERT INTO employees VALUES(3,'3号员工',2,2000,2,'333@qq.com');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [10]:
%%sql
# 检查条件2
# 插入dname不正确的部门
set foreign_key_checks=0;

INSERT INTO department VALUES(2,'测试部',4,5000);
INSERT INTO employees VALUES(4,'4号员工',2,1200,1,'444@qq.com');

set foreign_key_checks=0

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
(pymysql.err.DataError) (1265, "Data truncated for column 'dname' at row 1")
[SQL: INSERT INTO department VALUES(2,'测试部',4,5000);]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

In [11]:
%%sql
# 检查条件3
# 插入salary与level不匹配的员工、
INSERT INTO employees VALUES(5,'5号员工',1,1000,3,'555@qq.com');

 * mysql://stu2000012926:***@162.105.146.37:43306
(pymysql.err.OperationalError) (3819, "Check constraint 'chk_salary' is violated.")
[SQL: # 检查条件3
# 插入salary与level不匹配的员工、
INSERT INTO employees VALUES(5,'5号员工',1,1000,3,'555@qq.com');]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
%%sql
# 检查条件4
# 插入email格式不对的员工
INSERT INTO employees VALUES(6,'6号员工',1,1100,1,'error_email');

 * mysql://stu2000012926:***@162.105.146.37:43306
(pymysql.err.OperationalError) (3819, "Check constraint 'employees_chk_1' is violated.")
[SQL: # 检查条件4
# 插入email格式不对的员工
INSERT INTO employees VALUES(6,'6号员工',1,1100,1,'error_email');]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

接下来我们验证条件5，我们处理salary总和大于budget的情况选择钳制修改的值至可能的最大/最小值，而不是显式报错。具体例子如下：

In [13]:
%%sql
# 检查条件5
# 增加员工，使工资和超出预算
# 会自动修改工资为预算内的最大值，若不符合level则会报错
INSERT INTO employees VALUES(7,'7号员工',1,3900,3,'777@qq.com');
SELECT * FROM employees;

 * mysql://stu2000012926:***@162.105.146.37:43306
1 rows affected.
3 rows affected.

[(1, '1号员工', 1, 1300, 1, '111@qq.com'),
 (2, '2号员工', 1, 2600, 2, '222@qq.com'),
 (7, '7号员工', 1, 3100, 3, '777@qq.com')]

In [14]:
%%sql
# 检查条件5
# 将预算修改为7500
UPDATE department SET budget=7500 WHERE dno=1;
# 修改员工工资使工资和超出预算
# 会自动修改工资为预算内的最大值，若不符合level则会报错
UPDATE employees SET salary=4000 WHERE eno=7;
SELECT * FROM employees;

 * mysql://stu2000012926:***@162.105.146.37:43306
1 rows affected.
1 rows affected.
3 rows affected.

[(1, '1号员工', 1, 1300, 1, '111@qq.com'),
 (2, '2号员工', 1, 2600, 2, '222@qq.com'),
 (7, '7号员工', 1, 3600, 3, '777@qq.com')]

In [15]:
%%sql
# 检查条件5
# 删除员工7，总薪资变为3900
DELETE FROM employees WHERE eno=7;
# 修改部门预算使得预算小于总薪资
# 会自动修改预算为总薪资
UPDATE department SET budget=2000 WHERE dno=1;
SELECT * FROM department;

 * mysql://stu2000012926:***@162.105.146.37:43306
1 rows affected.
1 rows affected.
1 rows affected.

[(1, '销售部', 2, 3900)]

## 练习二：触发器设计
---  
先建立需要的表：

In [16]:
%%sql

DROP TABLE if EXISTS originData;
DROP TABLE if EXISTS sum_slidingWin;
DROP TABLE if EXISTS max_slidingWin;
DROP TABLE if EXISTS aggResult;

CREATE TABLE originData 
(
    id int AUTO_INCREMENT PRIMARY KEY,
    value int NOT NULL
);

CREATE TABLE sum_slidingWin (id int PRIMARY KEY, value int NOT NULL);

CREATE TABLE max_slidingWin(id int PRIMARY KEY, value int NOT NULL);

CREATE TABLE aggResult(sumRes int NOT NULL, maxRes int NOT NULL);

INSERT INTO aggResult VALUES (0, 0);

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.

[]

**1. 建立维护sum_slidingWin表和max_slidingWin表的触发器**

In [17]:
%%sql
DROP TRIGGER if EXISTS sum_slidingWin_update;
DROP TRIGGER if EXISTS max_slidingWin_update;

CREATE TRIGGER sum_slidingWin_update
AFTER
INSERT
    ON originData FOR EACH ROW BEGIN 

INSERT INTO
    sum_slidingWin (id, value)
VALUES
    (NEW.id, NEW.value);

DELETE FROM
    sum_slidingWin
WHERE
    id <= (
        SELECT
            id
        FROM
            sum_slidingWin
        ORDER BY
            id DESC
        LIMIT
            1 OFFSET 50
    );

END;

CREATE TRIGGER max_slidingWin_update
AFTER
INSERT
    ON originData FOR EACH ROW BEGIN 

INSERT INTO
    max_slidingWin (id, value)
VALUES
    (NEW.id, NEW.value);

DELETE FROM
    max_slidingWin
WHERE
    id <= (
        SELECT
            id
        FROM
            max_slidingWin
        ORDER BY
            id DESC
        LIMIT
            1 OFFSET 50
    );

END;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

**2. 更新aggResult表的触发器**

In [18]:
%%sql
DROP TRIGGER if EXISTS aggResult_update;

CREATE TRIGGER aggResult_update
AFTER
INSERT
    ON originData FOR EACH ROW BEGIN 
INSERT INTO
    aggResult
VALUES
    (
        (
            SELECT
                SUM(value)
            FROM
                sum_slidingWin
        ),
        (
            SELECT
                MAX(value)
            FROM
                max_slidingWin
        )
    );

END;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

**3. 使用单调队列维护max_slidingWin表**

In [19]:
%%sql

DROP TRIGGER if EXISTS max_slidingWin_update_opt;

CREATE TRIGGER max_slidingWin_update_opt
AFTER
INSERT
    ON originData FOR EACH ROW BEGIN 
-- 删除max_slidingWin表中队头不在窗口内的数据
DELETE FROM
    max_slidingWin
WHERE
    id <= NEW.id - 50;

-- 删除max_slidingWin表中队尾小于新插入数据的数据
DELETE FROM
    max_slidingWin
WHERE
    value < NEW.value;

-- 将新插入的数据添加到max_slidingWin表中
INSERT INTO
    max_slidingWin (id, value)
VALUES
    (NEW.id, NEW.value);

END;

 * mysql://stu2000012926:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]